{
    "Важно!": "Important!",
    "В связи с ограничениями json-server, бесплатных версий Vercel и Netlify,": "Due to the limitations of the json server, the free versions of Vercel and Netlify,",
    "Рекомендуется установить проект локально и запустить используя fork Github репозитория проекта.": "It is recommended to install the project locally and run it using the Github fork of the project repository.",
    "Github": "Github",
    "Про проект": "About this Project",
    "В основе, это SPA приложение, для обмена статьями на всевозможные темы.": "Basically, this is a SPA application for sharing articles on all kinds of topics.",
    "Сайт имеет 3 цветовых темы и интернализацию на 2-а языка, английский и русский.": "The site has 3 color themes and internalization in 2 languages, English and Russian.",
    "Присутствует профиль пользователя, распределение роутов по ролям и 2-е версии интерфейса.": "There is a user profile, the distribution of routes by roles and 2 versions of the interface.",
    "Список статей реализован через бесконечный скролл с постоянной подгрузкой новых статей.": "The list of articles is implemented through an endless scroll with constant loading of new articles.",
    "Реализована комплексная фильтрация статей, как по прямому поиску, так и по параметрам.": "Comprehensive filtering of articles has been implemented, both by direct search and by parameters.",
    "Статьи можно создавать, редактировать, удалять, оценивать а также писать к ним комментарии.": "Articles can be created, edited, deleted, rated, and commented on.",
    "Основные технологии проекта и архитектура": "The main technologies of the project and architecture",
    "Архитектура фронтенда создана следуя методологии:": "The frontend architecture was created following the methodology:",
    "Feature Slice Design.": "Feature Slice Design.",
    "Сам фронтенд основан на стэке:": "The frontend itself is based on a stack:",
    "TypeScript/": "TypeScript/",
    "React/": "React/",
    "Redux Toolkit.": "Redux Toolkit.",
    "Работа с API происходит используя:": "Working with the API takes place using:",
    "axios/": "axios/",
    "Redux Thunk/": "Redux Thunk/",
    "RTK Query.": "RTK Query.",
    "Работа со стилями происходит в рамках:": "Working with styles takes place within:",
    "CSS(SCSS) Modules.": "CSS(SCSS) Modules.",
    "В качестве сборщика, настроенный с нуля": "As a bundler, configured from scratch",
    "Webpack": "Webpack",
    "и небольшая альтернатива в виде": "and a small alternative in the form of",
    "Vite.": "Vite.",
    "Финальный бандл разбит на чанки и подгружается страницами асинхронно,": "The final bundle is divided into chunks and loaded with pages asynchronously,",
    "тем самым увеличивая скорость первичной загрузки и уменьшая размер главного чанка.": "thereby increasing the speed of the primary download and reducing the size of the main chunk.",
    "Для выявления визуальных багов и отслеживания изменений UI используется:": "To identify visual bugs and track UI changes, use:",
    "Storybook.": "Storybook.",
    "Удобство и стандартизация разработки": "Convenience and standardization of development",
    "Применяется": "Applies",
    "eslint": "eslint",
    "включающий в себя 3 самодельных плагина на проверку следованию правилам архитектуры": "It includes 3 homemade plug-ins to check compliance with the rules of the architecture",
    "stylelint": "stylelint",
    "для проверки написания файлов стилей": "to check the writing of style files",
    "prettier": "prettier",
    "для автоматического форматирования кода": "for automatic code formatting",
    "Тестирование": "Testing",
    "Фронтенд приложения покрыт всеми видами тестов:": "The frontend of the application is covered by all kinds of tests:",
    "Unit тесты": "Unit tests",
    "Jest": "Jest",
    "Component тесты": "Component tests",
    "React testing library": "React testing library",
    "UI тесты": "UI tests",
    "на связке": "on a bundle of",
    "и": "and",
    "Chromatic/": "Chromatic/",
    "Loki": "Loki",
    "e2e тесты": "e2e tests",
    "на": "with",
    "Cypress": "Cypress",
    "Библиотека компонентов": "Component Library",
    "Была создана своя библиотека компонентов на основе:": "Was created own library of components based on:",
    "headlessUi": "headlessUi",
    "Интернализация": "Internalization",
    "Сайт использует интернализацию, на русский и английский языки используя:": "The site uses internalization, into Russian and English using:",
    "i18next": "i18next",
    "Работа с FF или постепенная интеграция новых возможностей": "Working with FF or gradually integrating new features",
    "Для быстрого и удобного обновления приложения, работа с ними происходит по средствам": "For a quick and convenient update of the application, work with them takes place using",
    "Feature Flags": "Feature Flags",
    "Подробнее про работу с ними в данном проекте, можно узнать на": "You can find out more about working with them in this project on",
    "проекта в теме feature flags документации": "in the feature flags documentation topic",
    "Continuous Integration и pre-commit хуки": "Continuous Integration and pre-commit hooks",
    "Процесс проверки коммитов и пушей автоматизирован используя": "The process of checking commits and push is automated using",
    "GitHub Actions": "GitHub Actions",
    "husky.": "husky."
}
